# 이번 문제 교훈 : if /elif 차이 좀 명확히 알아야 함
# 그리고 무지성 if문 남발하지말자 else문 망가진다
# 카운팅 스킬 효율적으로 하는 법 좀 빨리 익혀야 한다
# 무지성 round쓰지말자 +1이 더 효율적일 때가 많다


N = input() # 문자 입력받고
cnt = [0] * 9 # 0,0,0,0,0,0,0,0,0
for idx in N: # 문자 내 루핑 돌리면서
    check = int(idx) # 인티져 변환하고
    if check==9: # 근데 그게 만약 9면
        check = 6 # 6으로 바꿔주고
    cnt[check] += 1 # 1업 해줘  이제 6을 기준으로 세트 개수를 판단할 것임.
cnt[6] = (cnt[6]+1)//2 # 6666을 넣었다치면 cnt[6] = 4인 상태인데  6은 9랑 혼용하니까 2로 나눠줘야함
# 근데 7777을 넣으면 cnt[7]= 4인 상태인데 7은 혼용하는게 없으니 그냥 그대로 4가 나옴
# round를 쓴 이유는 홀수 개수인 경우를 고려함 99999를 박으면 cnt[9] = 5개인데 6이랑 한쌍을 이루면서 혼용가능
# 그럼 세트 2개만 있으면 9 하나가 모자르니까 round를 씀  * round는 반올림
# 그럼 5//2 = 2.5 인데 round하면 3임  어차피 무조건 2로만 나눌거고 소수점은 .5일테니까 써도 무방
print(max(cnt))
